medicalopenworld/IncuNest/Firmware/SensorBoard_v2/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8
CONFIG_IDF_TARGET="esp32s3"

# USB TinyUSB CDC-ACM
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=4096
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4096

# Sin consola — los logs van como frames JSON sobre USB CDC (ADR-0001)
CONFIG_ESP_CONSOLE_NONE=y

# Flash 16MB + PSRAM OPI 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Cámara: sensores soportados (esp32-camera autodetecta por SCCB:
# OV2640 en 0x30, OV5640 en 0x3C)
CONFIG_OV2640_SUPPORT=y
CONFIG_OV5640_SUPPORT=y

# Nivel INFO: en DEBUG el escaneo I2C emite ~110 frames "nack" por bus y
# barre la retencion de arranque; subir a DEBUG puntualmente via menuconfig
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS tick 1kHz
CONFIG_FREERTOS_HZ=1000
